# Задача 1. 
# Написать программу, которая запрашивает у пользователя 
# произвольную строку и выводит на экран ее длину.
s = input("Введите строку: ")
print("Длина строки:", len(s))
